{"resposta1":"Basicamente uma conexão cliente-servidor.\r\nO cliente (browser) acessa um determinada pagina web que está atrelada á um (DNS), que localiza o endereço do host de onde está hospedada a pagina, em seguida enviando uma requisição http\/https ao servidor.\r\nO servidor autoriza essa requisição e envia uma resposta 200 OK ao cliente.\r\n\r\n","resposta2amaster":"ns1.ecomt4.com.br","resposta2aslave":"ns2.ecomt4.com.br","resposta2b":"Utilizei a ferramenta de verificação de servidor DNS do Registro BR.\r\nInformei o domínio (olatray.com.br) e pesquisei toda lista de DNS até detectar o \"status de autoridade sobre o domínio\" na mesma versão (2020050503), o dns ns1 possui um tempo de resposta melhor, por isso acredito que seja o master.","resposta3":"O endereço de e-mail não existe no domínio, porem o domínio é real.\r\n","resposta4a":"98732.tcdn.com.br","resposta4b":"177.67.115.98","resposta4c":"Utilizei o comando nslookup para localizar o servidor DNS, utilizando as urls para testes.\r\n\r\nnslookup -q=ns www.morijo.com.br\r\nnslookup -q=ns www.liviamassas.com.br\r\n\r\nna sequencia, detectei um padrão de canonical name, ID + tcdn.com.br, e em seguida executei um comando ping no CNAME (98732.tcdn.com.br) para pegar localizar o endereço de IP (A).","resposta5":"Utilizando ferramentas de monitoramento, por exemplo o zabbix criando cenários web, definindo limite de tempos de resposta, texto requerido e código de status esperado, se houver necessidade de monitorar um componente da aplicação com por exemplo um webservice, existe a possibilidade criar uma trigger para monitorar o uptime de uma porta http\/tcp em especifico.\r\nDependendo da necessidade do projeto existe a possibilidade utilizar um SAAS para apm server (Dynatrace, Datadog, New Relic).\r\nA baixo nível podemos monitorar uptime via linha de comando (ping, curl).","resposta6":"Ao executar este comando será removido recursivamente o diretório raiz do sistema operacional e todos os seus subdiretórios, mesmo se algum subdiretório tiver partição separada não será possível reiniciar o servidor, sendo necessário realizar a formatação do mesmo."}